searchpersonprob

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:par="http://www.ibm.com/mdm/port/Party" xmlns:sch="http://www.ibm.com/mdm/schema">
   <soapenv:Header/>
   <soapenv:Body>
      <par:searchPersonProbabilistic>
         <sch:RequestControl>
            <sch:requestID>11111</sch:requestID>
            <sch:DWLControl>
               <sch:requesterName>cusadmin</sch:requesterName>
               <sch:requesterLanguage>100</sch:requesterLanguage>
            </sch:DWLControl>
         </sch:RequestControl>
         <sch:ProbabilisticPersonSearchBObj>
            <!--Optional:-->
            <!--<sch:MinSuspectType>?</sch:MinSuspectType>-->
            <!--Optional:-->
            <sch:MinScore>0</sch:MinScore>
            <!--Optional:-->
            <!--<sch:MaxReturn>?</sch:MaxReturn>-->
            <!--Optional:-->
            <!--<sch:PMEContextKey>?</sch:PMEContextKey>-->
            <!--Zero or more repetitions:-->
            <TCRMPersonBObj>
               <BirthDate>1985-02-02</BirthDate>
               <GenderType>F</GenderType>
            </TCRMPersonBObj>
            <TCRMPersonNameBObj>
               <GivenNameOne>Elite</GivenNameOne>
               <GivenNameTwo>Elite</GivenNameTwo>
               <LastName>Elite</LastName>
            </TCRMPersonNameBObj>
            <TCRMPartyAddressBObj>
               <TCRMAddressBObj>
                  <AddressLineOne>Elite1</AddressLineOne>
                  <!--<AddressLineTwo>Elite1</AddressLineTwo>-->
                  <!--<City>Coventry</City>-->
                  <ZipPostalCode>ST1 3SW</ZipPostalCode>
                  <!--<ResidenceNumber>12</ResidenceNumber>-->
                  <!--<CountryType>250</CountryType>-->
                  <!--<CountryValue>GBR</CountryValue>-->
                  <!--<StandardFormatingIndicator>Y</StandardFormatingIndicator>-->
                  <TCRMExtension>
                     <ExtendedObject>XAddressBObjExt</ExtendedObject>
                     <XAddressBObjExt>
                        <!--<accuracycode>V44-I44-P6-100</accuracycode>-->
                     </XAddressBObjExt>
                  </TCRMExtension>
               </TCRMAddressBObj>
            </TCRMPartyAddressBObj>
            <TCRMPartyContactMethodBObj>
               <!--<ContactMethodUsageType>3</ContactMethodUsageType>-->
               <!--<ContactMethodUsageValue>Mobile</ContactMethodUsageValue>-->
               <TCRMContactMethodBObj>
                  <ReferenceNumber>9842221242</ReferenceNumber>
                  <!--<ContactMethodType>1</ContactMethodType>-->
                  <!--<ContactMethodValue>Phone</ContactMethodValue>-->
               </TCRMContactMethodBObj>
            </TCRMPartyContactMethodBObj>
            <TCRMPartyContactMethodBObj>
               <TCRMContactMethodBObj>
                  <ReferenceNumber>abc@gmail.com</ReferenceNumber>
               </TCRMContactMethodBObj>
            </TCRMPartyContactMethodBObj>
            <TCRMPartyIdentificationBObj>
               <!--<IdentificationType>1</IdentificationType>-->
               <IdentificationValue>Nectar ID</IdentificationValue>
               <IdentificationNumber>482000001</IdentificationNumber>
            </TCRMPartyIdentificationBObj>
         </sch:ProbabilisticPersonSearchBObj>
      </par:searchPersonProbabilistic>
   </soapenv:Body>
</soapenv:Envelope>
